driver-tests/bpelse/nmproperty/FromToPropertySpec/src/assignToEmptyVar/assignToEmptyVar.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="assignToEmptyVar" targetNamespace="http://j2ee.netbeans.org/wsdl/assignToEmptyVar"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/assignToEmptyVar" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <types/>
    <message name="assignToEmptyVarOperationRequest">
        <part name="part1" type="xsd:string"/>
    </message>
    <message name="assignToEmptyVarOperationResponse">
        <part name="part1" type="xsd:string"/>
    </message>
    <portType name="assignToEmptyVarPortType">
        <operation name="assignToEmptyVarOperation">
            <input name="input1" message="tns:assignToEmptyVarOperationRequest"/>
            <output name="output1" message="tns:assignToEmptyVarOperationResponse"/>
        </operation>
    </portType>
    <binding name="assignToEmptyVarBinding" type="tns:assignToEmptyVarPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="assignToEmptyVarOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/assignToEmptyVar"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/assignToEmptyVar"/>
            </output>
        </operation>
    </binding>
    <service name="assignToEmptyVarService">
        <port name="assignToEmptyVarPort" binding="tns:assignToEmptyVarBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/assignToEmptyVarService/assignToEmptyVarPort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="assignToEmptyVar">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="assignToEmptyVarPortTypeRole" portType="tns:assignToEmptyVarPortType"/>
    </plnk:partnerLinkType>
</definitions>
