driver-tests/bpelse/nmproperty/FromToPropertySpecJBI/test/assignToEmptyVar/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ass="http://j2ee.netbeans.org/wsdl/assignToEmptyVar">
  <soapenv:Body>
    <ass:assignToEmptyVarOperation>
      <part1>Hello</part1>
    </ass:assignToEmptyVarOperation>
  </soapenv:Body>
</soapenv:Envelope>